#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01330a1407e1caa29]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d9cb36da62d6f922]
module.vpc.module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0777a034945c4a2f1]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-068fa2005b6b9115a]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b56f9be43cfdc90e]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05ebf762418c4a32e]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-051c14800a00c1bbd]
module.ec2_cluster.module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-052017f72828a41a8]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e34496d5f1b811a4]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f7f738a0b4575f9f]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-00cb90f74cac5c388]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-021257282ed8968ea]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-075ab2ee8a43ecfee]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b052912de4252fdb]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a68200fc086ead3e]
module.vpc.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-00f6351418b27c04f]
module.vpc.module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-08ae119a2b216d32e]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-078efaac66b161e67]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-012fcf2cd1051997f]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-074a853076870b34d]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-09db3b2114598f963]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-09132709ffc4f716e]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b56f9be43cfdc90e1080289494]
module.ec2_cluster.module.security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2421576937]
module.ec2_cluster.module.security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3530156698]
module.ec2_cluster.module.security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-811292148]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a88362ce4307b840]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04fc04cbea65e7a4a]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04185a6389a328419]
module.vpc.module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-00f6351418b27c04f1080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-021257282ed8968ea1080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0a68200fc086ead3e1080289494]
module.ec2_cluster.module.ec2_cluster.aws_instance.this[2]: Refreshing state... [id=i-0ae94d3a538a3af8e]
module.ec2_cluster.module.ec2_cluster.aws_instance.this[0]: Refreshing state... [id=i-0d1dfeb539c103485]
module.ec2_cluster.module.ec2_cluster.aws_instance.this[1]: Refreshing state... [id=i-0774db58b65f326ef]
module.ec2_cluster.aws_ebs_volume.this[1]: Refreshing state... [id=vol-0d5bcd1a39d89eb03]
module.ec2_cluster.aws_ebs_volume.this[0]: Refreshing state... [id=vol-031ed8e481660945f]
module.ec2_cluster.aws_ebs_volume.this[2]: Refreshing state... [id=vol-0fccf894c4bc52de8]
module.ec2_cluster.aws_volume_attachment.this_ec2[2]: Refreshing state... [id=vai-1960582677]
module.ec2_cluster.aws_volume_attachment.this_ec2[1]: Refreshing state... [id=vai-2220925955]
module.ec2_cluster.aws_volume_attachment.this_ec2[0]: Refreshing state... [id=vai-3890416212]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_cluster.aws_ebs_volume.this[3] will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = (known after apply)
      + encrypted         = true
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 1
      + snapshot_id       = (known after apply)
      + type              = "gp2"
    }

  # module.ec2_cluster.aws_ebs_volume.this[4] will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = (known after apply)
      + encrypted         = true
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 1
      + snapshot_id       = (known after apply)
      + type              = "gp2"
    }

  # module.ec2_cluster.aws_volume_attachment.this_ec2[3] will be created
  + resource "aws_volume_attachment" "this_ec2" {
      + device_name = "/dev/sdh"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

  # module.ec2_cluster.aws_volume_attachment.this_ec2[4] will be created
  + resource "aws_volume_attachment" "this_ec2" {
      + device_name = "/dev/sdh"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

  # module.ec2_cluster.module.ec2_cluster.aws_instance.this[3] will be created
  + resource "aws_instance" "this" {
      + ami                          = "ami-09b9e380df60300c8"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + disable_api_termination      = false
      + ebs_optimized                = false
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + monitoring                   = false
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-05ebf762418c4a32e"
      + tags                         = {
          + "Name" = "awesome-ec2-cluster-4"
        }
      + tenancy                      = "default"
      + volume_tags                  = {
          + "Name" = "awesome-ec2-cluster-4"
        }
      + vpc_security_group_ids       = [
          + "sg-052017f72828a41a8",
        ]

      + credit_specification {
          + cpu_credits = "standard"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2_cluster.module.ec2_cluster.aws_instance.this[4] will be created
  + resource "aws_instance" "this" {
      + ami                          = "ami-09b9e380df60300c8"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + disable_api_termination      = false
      + ebs_optimized                = false
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + monitoring                   = false
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-05ebf762418c4a32e"
      + tags                         = {
          + "Name" = "awesome-ec2-cluster-5"
        }
      + tenancy                      = "default"
      + volume_tags                  = {
          + "Name" = "awesome-ec2-cluster-5"
        }
      + vpc_security_group_ids       = [
          + "sg-052017f72828a41a8",
        ]

      + credit_specification {
          + cpu_credits = "standard"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @bmbferreira, Action: `pull_request`, Working Directory: `terraform/production`, Workflow: `Awesome Terraform Workflow`*